Repository: Annas319/TrafficIQ
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ur

source: Know the Rules, Save Lives
ur: قوانین جانیے، زندگیاں بچائیے

source: Master Pakistan's traffic rules with TrafficIQ – your complete road safety guide.
ur: ٹریفک آئی کیو کے ساتھ پاکستان کے ٹریفک قوانین سیکھیں – آپ کی مکمل روڈ سیفٹی رہنمائی۔

source: Start Learning Now
ur: ابھی سیکھنا شروع کریں

source: Less Boring... More Learning!
ur: کم بورنگ... زیادہ سیکھنے کا مزہ!

source: We’ve all been there. You scroll through endless traffic rule books. You wonder if you’re actually learning anything. You’d rather be watching Netflix or having a burger. We totally get it!
ur: ہم سب اس مرحلے سے گزرے ہیں۔ آپ بے شمار ٹریفک قوانین کی کتابیں دیکھتے ہیں۔ سوچتے ہیں کہ کیا واقعی کچھ سیکھ رہے ہیں۔ آپ کو لگتا ہے کہ نیٹ فلکس دیکھنا یا برگر کھانا بہتر ہے۔ ہم بالکل سمجھتے ہیں!

source: At TrafficIQ, we make learning road safety and driving rules fun, simple, and engaging. No heavy textbooks. No complicated jargon. Just interactive quizzes, easy tutorials, and traffic rules explained so clearly, you’ll feel confident behind the wheel in no time.
ur: ٹریفک آئی کیو میں ہم روڈ سیفٹی اور ڈرائیونگ قوانین کو سیکھنا دلچسپ، آسان اور دلکش بناتے ہیں۔ نہ بھاری کتابیں، نہ مشکل اصطلاحات۔ صرف انٹرایکٹو کوئزز، آسان ٹیوٹوریلز اور ٹریفک قوانین کی واضح وضاحت، تاکہ آپ جلد ہی گاڑی چلانے میں پراعتماد محسوس کریں۔

source: Who knew learning traffic laws could actually be enjoyable?
ur: کون جانتا تھا کہ ٹریفک قوانین سیکھنا دلچسپ بھی ہوسکتا ہے؟

source: Why Choose TrafficIQ?
ur: ٹریفک آئی کیو کیوں منتخب کریں؟

source: Understand Road Signs
ur: سڑک کے نشانات کو سمجھیں

source: Learn the meanings of traffic signs used across Pakistan.
ur: پاکستان بھر میں استعمال ہونے والے ٹریفک نشانات کے معنی سیکھیں۔

source: Pass License Tests
ur: لائسنس ٹیسٹ پاس کریں

source: Practice mock tests to prepare for official driving exams.
ur: سرکاری ڈرائیونگ امتحانات کی تیاری کے لیے مشقی ٹیسٹ کریں۔

source: Learn on the Go
ur: چلتے پھرتے سیکھیں

source: Mobile-friendly platform so you can learn anytime, anywhere.
ur: موبائل فرینڈلی پلیٹ فارم تاکہ آپ کہیں بھی، کبھی بھی سیکھ سکیں۔

source: Learn Smarter with TrafficIQ
ur: ٹریفک آئی کیو کے ساتھ آسانی سے سیکھیں

source: Traffic Rules
ur: ٹریفک قوانین

source: Discover essential road rules explained simply to help you drive safe and smart.
ur: اہم سڑک کے قوانین آسان انداز میں جانیں تاکہ آپ محفوظ اور سمجھداری سے گاڑی چلائیں۔

source: Explore Rules
ur: قوانین دیکھیں

source: Interactive Tutorials
ur: انٹرایکٹو ٹیوٹوریلز

source: Learn step-by-step with engaging tutorials designed to make driving knowledge simple.
ur: دلچسپ ٹیوٹوریلز کے ذریعے مرحلہ وار سیکھیں جو ڈرائیونگ علم کو آسان بناتے ہیں۔

source: View Tutorials
ur: ٹیوٹوریلز دیکھیں

source: Traffic Quiz
ur: ٹریفک کوئز

source: Test your knowledge with fun quizzes and track your progress instantly.
ur: دلچسپ کوئزز کے ذریعے اپنا علم آزمائیں اور فوری طور پر اپنی پیشرفت دیکھیں۔

source: Take Quiz
ur: کوئز دیں

source: My Profile
ur: میرا پروفائل

source: Update Profile
ur: میرا پروفائل

source: Username
ur: صارف نام

source: Required. 150 characters or fewer. Letters, digits and @/./+/-/_ only.
ur: لازمی۔ 150 حروف یا کم۔ صرف حروف، ہندسے اور @/./+/-/_ استعمال کریں۔

source: Email address
ur: ای میل پتہ

source: Phone
ur: فون

source: City
ur: شہر

source: Profile picture
ur: پروفائل تصویر

source: Submit
ur: جمع کریں

source: Correct! Well done.
ur: صحیح! بہت خوب۔

source: Incorrect. The correct answer was:
ur: غلط۔ درست جواب تھا:

source: No quiz questions available.
ur: کوئی کوئز سوال دستیاب نہیں۔

source: Test Result
ur: ٹیسٹ کا نتیجہ

source: Score
ur: اسکور

source: Percentage
ur: فیصد

source: Congratulations! You Passed.
ur: مبارک ہو! آپ کامیاب ہوگئے۔

source: Better Luck Next Time!
ur: اگلی بار کے لیے نیک تمنائیں

source: Back to Home
ur: واپس ہوم پر جائیں

source: Traffic Rules & Regulations
ur: ٹریفک قوانین

source: Access official traffic laws, highway code, and important documents published by Pakistan Traffic Police.
ur: پاکستان ٹریفک پولیس کی جانب سے جاری کردہ سرکاری قوانین، ہائی وے کوڈ اور اہم دستاویزات تک رسائی حاصل کریں۔

source: Download
ur: ڈاؤن لوڈ کریں

source: No traffic rules have been uploaded yet.
ur: ابھی تک کوئی ٹریفک قوانین اپ لوڈ نہیں کیے گئے۔

source: Tutorials
ur: ٹیوٹوریلز دیکھیں

source: View Tutorial
ur: سبق دیکھیں

source: Rules
ur: قوانین

source: Quiz
ur: کوئز دیں

source: English
ur: انگریزی

source: Urdu
ur: اردو

source: Dark Mode
ur: ڈارک موڈ

source: Profile
ur: پروفائل

source: Logout
ur: لاگ آؤٹ

source: Login
ur: لاگ ان

source: Learn Traffic Rules, Take Quizzes, and Stay Safe on the Road.
ur: ٹریفک قوانین سیکھیں، کوئزز دیں اور سڑک پر محفوظ رہیں۔

source: Developed by
ur: تیار کردہ

source: Messages
ur: پیغامات

source: Site Maps
ur: سائٹ کے نقشے

source: Static Files
ur: جامد فائلیں

source: Syndication
ur: سنڈیکیشن

source: That page number is not an integer
ur: یہ صفحہ نمبر صحیح عدد نہیں ہے

source: That page number is less than 1
ur: یہ صفحہ نمبر 1 سے کم ہے

source: That page contains no results
ur: اس صفحے پر کوئی نتائج نہیں ہیں

source: Enter a valid value.
ur: درست قدر درج کریں۔

source: Enter a valid domain name.
ur: درست ڈومین نام درج کریں۔

source: Enter a valid URL.
ur: درست یو آر ایل درج کریں۔

source: Enter a valid integer.
ur: درست عدد درج کریں۔

source: Enter a valid email address.
ur: درست ای میل پتہ درج کریں۔

source: Enter a valid “slug” consisting of letters, numbers, underscores or hyphens.
ur: درست سلگ درج کریں جو حروف، نمبروں، انڈر اسکور یا ہائفن پر مشتمل ہو۔

source: Enter a valid “slug” consisting of Unicode letters, numbers, underscores, or hyphens.
ur: درست سلگ درج کریں جو یونیکوڈ حروف، نمبروں، انڈر اسکور یا ہائفن پر مشتمل ہو۔

source: Enter a valid %(protocol)s address.
ur: درست %(protocol)s ایڈریس درج کریں۔

source: IPv4
ur: آئی پی وی 4

source: IPv6
ur: آئی پی وی 6

source: IPv4 or IPv6
ur: آئی پی وی 4 یا آئی پی وی 6

source: Enter only digits separated by commas.
ur: صرف ہندسوں کو کوما کے ساتھ درج کریں۔

source: Ensure this value is %(limit_value)s (it is %(show_value)s).
ur: یقینی بنائیں کہ یہ قدر %(limit_value)s ہے (یہ %(show_value)s ہے)۔

source: Ensure this value is less than or equal to %(limit_value)s.
ur: یقینی بنائیں کہ یہ قدر %(limit_value)s سے کم یا برابر ہے۔

source: Ensure this value is greater than or equal to %(limit_value)s.
ur: یقینی بنائیں کہ یہ قدر %(limit_value)s سے زیادہ یا برابر ہے۔

source: Ensure this value is a multiple of step size %(limit_value)s.
ur: یقینی بنائیں کہ یہ قدر %(limit_value)s کے مضاعف ہے۔

source: Ensure this value is a multiple of step size %(limit_value)s, starting from %(offset)s, e.g. %(offset)s, %(valid_value1)s, %(valid_value2)s, and so on.
ur: یقینی بنائیں کہ یہ قدر %(limit_value)s کے مضاعف ہے، شروع %(offset)s سے، مثلاً %(offset)s، %(valid_value1)s، %(valid_value2)s وغیرہ۔

source: Ensure this value has at least %(limit_value)d character (it has %(show_value)d).
ur: یقینی بنائیں کہ اس قدر میں کم از کم %(limit_value)d حرف ہے (اس میں %(show_value)d ہے)۔

source: Ensure this value has at most %(limit_value)d character (it has %(show_value)d).
ur: یقینی بنائیں کہ اس قدر میں زیادہ سے زیادہ %(limit_value)d حرف ہے (اس میں %(show_value)d ہے)۔

source: Enter a number.
ur: ایک نمبر درج کریں۔

source: Ensure that there are no more than %(max)s digit in total.
ur: یقینی بنائیں کہ کل ہندسوں کی تعداد %(max)s سے زیادہ نہ ہو۔

source: Ensure that there are no more than %(max)s decimal place.
ur: یقینی بنائیں کہ اعشاریہ کے بعد زیادہ سے زیادہ %(max)s جگہ ہو۔

source: Ensure that there are no more than %(max)s digit before the decimal point.
ur: یقینی بنائیں کہ اعشاریہ سے پہلے زیادہ سے زیادہ %(max)s ہندسہ ہو۔

source: File extension “%(extension)s” is not allowed. Allowed extensions are: %(allowed_extensions)s.
ur: فائل ایکسٹینشن “%(extension)s” کی اجازت نہیں ہے۔ اجازت شدہ ایکسٹینشنز یہ ہیں: %(allowed_extensions)s۔

source: Null characters are not allowed.
ur: خالی کریکٹرز کی اجازت نہیں ہے۔

source: and
ur: اور

source: %(model_name)s with this %(field_labels)s already exists.
ur: %(model_name)s اس %(field_labels)s کے ساتھ پہلے سے موجود ہے۔

source: Constraint “%(name)s” is violated.
ur: پابندی “%(name)s” کی خلاف ورزی ہوئی ہے۔

source: Value %(value)r is not a valid choice.
ur: قدر %(value)r درست انتخاب نہیں ہے۔

source: This field cannot be null.
ur: یہ فیلڈ خالی نہیں ہوسکتی۔

source: This field cannot be blank.
ur: یہ فیلڈ خالی نہیں چھوڑا جا سکتا۔

source: %(model_name)s with this %(field_label)s already exists.
ur: %(model_name)s اس %(field_label)s کے ساتھ پہلے سے موجود ہے۔

source: %(field_label)s must be unique for %(date_field_label)s %(lookup_type)s.
ur: %(field_label)s کو %(date_field_label)s %(lookup_type)s کے لیے منفرد ہونا چاہیے۔

source: Field of type: %(field_type)s
ur: فیلڈ کی قسم: %(field_type)s

source: “%(value)s” value must be either True or False.
ur: “%(value)s” قدر صرف درست یا غلط ہونی چاہیے۔

source: “%(value)s” value must be either True, False, or None.
ur: “%(value)s” قدر درست، غلط یا کوئی نہیں ہونی چاہیے۔

source: Boolean (Either True or False)
ur: بولین (یا درست یا غلط)

source: String (up to %(max_length)s)
ur: سٹرنگ (زیادہ سے زیادہ %(max_length)s تک)

source: String (unlimited)
ur: سٹرنگ (لامحدود)

source: Comma-separated integers
ur: کوما سے جدا کیے گئے اعداد

source: “%(value)s” value has an invalid date format. It must be in YYYY-MM-DD format.
ur: “%(value)s” قدر کا تاریخ فارمیٹ غلط ہے۔ یہ YYYY-MM-DD فارمیٹ میں ہونا چاہیے۔

source: “%(value)s” value has the correct format (YYYY-MM-DD) but it is an invalid date.
ur: “%(value)s” قدر کا فارمیٹ درست ہے (YYYY-MM-DD) لیکن یہ تاریخ غلط ہے۔

source: Date (without time)
ur: تاریخ (وقت کے بغیر)

source: “%(value)s” value has an invalid format. It must be in YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] format.
ur: “%(value)s” قدر کا فارمیٹ غلط ہے۔ یہ YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] فارمیٹ میں ہونا چاہیے۔

source: “%(value)s” value has the correct format (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]) but it is an invalid date/time.
ur: “%(value)s” قدر کا فارمیٹ درست ہے (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]) لیکن یہ تاریخ/وقت غلط ہے۔

source: Date (with time)
ur: تاریخ (وقت کے ساتھ)

source: “%(value)s” value must be a decimal number.
ur: “%(value)s” قدر اعشاریہ نمبر ہونی چاہیے۔

source: Decimal number
ur: اعشاریہ نمبر

source: “%(value)s” value has an invalid format. It must be in [DD] [[HH:]MM:]ss[.uuuuuu] format.
ur: “%(value)s” قدر کا فارمیٹ غلط ہے۔ یہ [DD] [[HH:]MM:]ss[.uuuuuu] فارمیٹ میں ہونا چاہیے۔

source: Duration
ur: دورانیہ

source: File path
ur: فائل کا راستہ

source: “%(value)s” value must be a float.
ur: “%(value)s” قدر فلوٹ نمبر ہونی چاہیے۔

source: Floating point number
ur: فلوٹنگ پوائنٹ نمبر

source: “%(value)s” value must be an integer.
ur: “%(value)s” قدر صحیح عدد ہونی چاہیے۔

source: Integer
ur: صحیح عدد

source: Big (8 byte) integer
ur: بڑا (8 بائٹ) عدد

source: Small integer
ur: چھوٹا عدد

source: IPv4 address
ur: آئی پی وی 4 ایڈریس

source: IP address
ur: آئی پی ایڈریس

source: “%(value)s” value must be either None, True or False.
ur: “%(value)s” قدر یا تو خالی، درست یا غلط ہونی چاہیے۔

source: Boolean (Either True, False or None)
ur: بولین (درست، غلط یا خالی)

source: Positive big integer
ur: مثبت بڑا عدد

source: Positive integer
ur: مثبت عدد

source: Positive small integer
ur: مثبت چھوٹا عدد

source: Slug (up to %(max_length)s)
ur: سلگ (زیادہ سے زیادہ %(max_length)s تک)

source: Text
ur: متن

source: “%(value)s” value has an invalid format. It must be in HH:MM[:ss[.uuuuuu]] format.
ur: “%(value)s” قدر کا فارمیٹ غلط ہے۔ یہ HH:MM[:ss[.uuuuuu]] فارمیٹ میں ہونا چاہیے۔

source: “%(value)s” value has the correct format (HH:MM[:ss[.uuuuuu]]) but it is an invalid time.
ur: “%(value)s” قدر کا فارمیٹ درست ہے (HH:MM[:ss[.uuuuuu]]) لیکن یہ وقت غلط ہے۔

source: Time
ur: وقت

source: URL
ur: یو آر ایل

source: Raw binary data
ur: خام بائنری ڈیٹا

source: “%(value)s” is not a valid UUID.
ur: “%(value)s” درست UUID نہیں ہے۔

source: Universally unique identifier
ur: یونیورسل منفرد شناخت کنندہ

source: File
ur: فائل

source: Image
ur: تصویر

source: A JSON object
ur: ایک JSON آبجیکٹ

source: Value must be valid JSON.
ur: قدر درست JSON ہونی چاہیے۔

source: %(model)s instance with %(field)s %(value)r is not a valid choice.
ur: %(model)s انسٹینس جس میں %(field)s %(value)r ہے درست انتخاب نہیں ہے۔

source: Foreign Key (type determined by related field)
ur: فارن کی (قسم متعلقہ فیلڈ سے متعین ہوتی ہے)

source: One-to-one relationship
ur: ایک سے ایک تعلق

source: %(from)s-%(to)s relationship
ur: %(from)s-%(to)s تعلق

source: %(from)s-%(to)s relationships
ur: %(from)s-%(to)s تعلقات

source: Many-to-many relationship
ur: کئی سے کئی تعلق

source: This field is required.
ur: یہ فیلڈ لازمی ہے۔

source: Enter a whole number.
ur: ایک مکمل عدد درج کریں

source: Please either submit a file or check the clear checkbox, not both.
ur: براہ کرم یا تو فائل جمع کریں یا کلئیر چیک باکس منتخب کریں، دونوں نہیں۔

source: Upload a valid image. The file you uploaded was either not an image or a corrupted image.
ur: درست تصویر اپ لوڈ کریں۔ جو فائل آپ نے اپ لوڈ کی ہے وہ یا تو تصویر نہیں ہے یا خراب ہے۔

source: Select a valid choice. %(value)s is not one of the available choices.
ur: درست انتخاب کریں۔ %(value)s دستیاب انتخاب میں شامل نہیں ہے۔

source: Enter a list of values.
ur: قدروں کی فہرست درج کریں۔

source: Enter a complete value.
ur: مکمل قدر درج کریں۔

source: Enter a valid UUID.
ur: درست UUID درج کریں۔

source: Enter a valid JSON.
ur: درست JSON درج کریں۔

source: (Hidden field %(name)s) %(error)s
ur: (چھپی ہوئی فیلڈ %(name)s) %(error)s

source: ManagementForm data is missing or has been tampered with. Missing fields: %(field_names)s. You may need to file a bug report if the issue persists.
ur: مینجمنٹ فارم کا ڈیٹا غائب ہے یا اس میں تبدیلی کی گئی ہے۔ غائب فیلڈز: %(field_names)s۔ اگر مسئلہ برقرار رہے تو آپ کو بگ رپورٹ درج کرنی پڑ سکتی ہے۔

source: Please submit at most %(num)d form.
ur: براہ کرم زیادہ سے زیادہ %(num)d فارم جمع کریں۔

source: Please submit at least %(num)d form.
ur: براہ کرم کم از کم %(num)d فارم جمع کریں۔

source: Order
ur: ترتیب

source: Delete
ur: حذف کریں

source: Please correct the duplicate data for %(field)s.
ur: براہ کرم %(field)s کے لیے دہرایا گیا ڈیٹا درست کریں۔

source: Please correct the duplicate data for %(field)s, which must be unique.
ur: براہ کرم %(field)s کے لیے دہرایا گیا ڈیٹا درست کریں، جو منفرد ہونا چاہیے۔

source: Please correct the duplicate data for %(field_name)s which must be unique for the %(lookup)s in %(date_field)s.
ur: براہ کرم %(field_name)s کے لیے دہرایا گیا ڈیٹا درست کریں جو %(date_field)s میں %(lookup)s کے لیے منفرد ہونا چاہیے۔

source: Please correct the duplicate values below.
ur: براہ کرم نیچے دی گئی دہرائی گئی قدریں درست کریں۔

source: The inline value did not match the parent instance.
ur: ان لائن قدر والد انسٹینس سے مطابقت نہیں رکھتی۔

source: Select a valid choice. That choice is not one of the available choices.
ur: درست انتخاب کریں۔ یہ انتخاب دستیاب انتخاب میں شامل نہیں ہے۔

source: “%(pk)s” is not a valid value.
ur: “%(pk)s” درست قدر نہیں ہے۔

source: %(datetime)s couldn’t be interpreted in time zone %(current_timezone)s; it may be ambiguous or it may not exist.
ur: %(datetime)s کو ٹائم زون %(current_timezone)s میں سمجھا نہیں جا سکا؛ یہ مبہم ہو سکتا ہے یا موجود نہ ہو۔

source: Clear
ur: صاف کریں

source: Currently
ur: فی الحال

source: Change
ur: تبدیل کریں

source: Unknown
ur: نامعلوم

source: Yes
ur: ہاں

source: No
ur: نہیں

source: yes,no,maybe
ur: ہاں،نہیں،شاید

source: %(size)d byte
ur: %(size)d بائٹ

source: %s KB
ur: %s کلو بائٹ

source: %s MB
ur: %s ایم بی

source: %s GB
ur: %s جی بی

source: %s TB
ur: %s ٹی بی

source: %s PB
ur: %s پی بی

source: p.m.
ur: شام

source: a.m.
ur: صبح

source: PM
ur: پی ایم

source: AM
ur: اے ایم

source: midnight
ur: آدھی رات

source: noon
ur: دوپہر

source: Monday
ur: پیر

source: Tuesday
ur: منگل

source: Wednesday
ur: بدھ

source: Thursday
ur: جمعرات

source: Friday
ur: جمعہ

source: Saturday
ur: ہفتہ

source: Sunday
ur: اتوار

source: Mon
ur: پیر

source: Tue
ur: منگل

source: Wed
ur: بدھ

source: Thu
ur: جمعرات

source: Fri
ur: جمعہ

source: Sat
ur: ہفتہ

source: Sun
ur: اتوار

source: January
ur: جنوری

source: February
ur: فروری

source: March
ur: مارچ

source: April
ur: اپریل

source: May
ur: مئی

source: June
ur: جون

source: July
ur: جولائی

source: August
ur: اگست

source: September
ur: ستمبر

source: October
ur: اکتوبر

source: November
ur: نومبر

source: December
ur: دسمبر

source: jan
ur: جنوری

source: feb
ur: فروری

source: mar
ur: مارچ

source: apr
ur: اپریل

source: may
ur: مئی

source: jun
ur: جون

source: jul
ur: جولائی

source: aug
ur: اگست

source: sep
ur: ستمبر

source: oct
ur: اکتوبر

source: nov
ur: نومبر

source: dec
ur: دسمبر

# abbrev. month
source: Jan.
ur: جنوری

# abbrev. month
source: Feb.
ur: فروری

# abbrev. month
source: March
ur: مارچ

# abbrev. month
source: April
ur: اپریل

# abbrev. month
source: May
ur: مئی

# abbrev. month
source: June
ur: جون

# abbrev. month
source: July
ur: جولائی

# abbrev. month
source: Aug.
ur: اگست

# abbrev. month
source: Sept.
ur: ستمبر

# abbrev. month
source: Oct.
ur: اکتوبر

# abbrev. month
source: Nov.
ur: نومبر

# abbrev. month
source: Dec.
ur: دسمبر

# alt. month
source: January
ur: جنوری

# alt. month
source: February
ur: فروری

# alt. month
source: March
ur: مارچ

# alt. month
source: April
ur: اپریل

# alt. month
source: May
ur: مئی

# alt. month
source: June
ur: جون

# alt. month
source: July
ur: جولائی

# alt. month
source: August
ur: اگست

# alt. month
source: September
ur: ستمبر

# alt. month
source: October
ur: اکتوبر

# alt. month
source: November
ur: نومبر

# alt. month
source: December
ur: دسمبر

source: This is not a valid IPv6 address.
ur: یہ درست IPv6 ایڈریس نہیں ہے۔

source: or
ur: یا

source: %(num)d year
ur: %(num)d سال

source: %(num)d month
ur: %(num)d مہینہ

source: %(num)d week
ur: %(num)d ہفتہ

source: %(num)d day
ur: %(num)d دن

source: %(num)d hour
ur: %(num)d گھنٹہ

source: %(num)d minute
ur: %(num)d منٹ

source: Forbidden
ur: ممنوع

source: CSRF verification failed. Request aborted.
ur: CSRF تصدیق ناکام ہوگئی۔ درخواست منسوخ کر دی گئی۔

source: You are seeing this message because this HTTPS site requires a “Referer header” to be sent by your web browser, but none was sent. This header is required for security reasons, to ensure that your browser is not being hijacked by third parties.
ur: آپ یہ پیغام دیکھ رہے ہیں کیونکہ اس HTTPS سائٹ کو آپ کے ویب براؤزر سے “ریفرر ہیڈر” بھیجنے کی ضرورت ہے، لیکن کوئی نہیں بھیجا گیا۔ یہ ہیڈر سیکیورٹی وجوہات کی بنا پر ضروری ہے تاکہ یہ یقینی بنایا جا سکے کہ آپ کا براؤزر کسی تیسرے فریق کے ذریعے ہائی جیک نہ ہو۔

source: If you have configured your browser to disable “Referer” headers, please re-enable them, at least for this site, or for HTTPS connections, or for “same-origin” requests.
ur: اگر آپ نے اپنے براؤزر کو “ریفرر” ہیڈرز کو غیر فعال کرنے کے لیے ترتیب دیا ہے، تو براہ کرم انہیں دوبارہ فعال کریں، کم از کم اس سائٹ کے لیے، یا HTTPS کنکشنز کے لیے، یا “سیم اوریجن” درخواستوں کے لیے۔

source: If you are using the <meta name="referrer" content="no-referrer"> tag or including the “Referrer-Policy: no-referrer” header, please remove them. The CSRF protection requires the “Referer” header to do strict referer checking. If you’re concerned about privacy, use alternatives like <a rel="noreferrer" …> for links to third-party sites.
ur: اگر آپ <meta name="referrer" content="no-referrer"> ٹیگ استعمال کر رہے ہیں یا “Referrer-Policy: no-referrer” ہیڈر شامل کر رہے ہیں، تو براہ کرم انہیں ہٹا دیں۔ CSRF تحفظ کے لیے “ریفرر” ہیڈر کی سخت جانچ ضروری ہے۔ اگر آپ کو پرائیویسی کی فکر ہے، تو تیسرے فریق کی سائٹس کے لنکس کے لیے <a rel="noreferrer" …> جیسے متبادل استعمال کریں۔

source: You are seeing this message because this site requires a CSRF cookie when submitting forms. This cookie is required for security reasons, to ensure that your browser is not being hijacked by third parties.
ur: آپ یہ پیغام دیکھ رہے ہیں کیونکہ اس سائٹ کو فارم جمع کراتے وقت CSRF کوکی کی ضرورت ہے۔ یہ کوکی سیکیورٹی وجوہات کی بنا پر ضروری ہے تاکہ یہ یقینی بنایا جا سکے کہ آپ کا براؤزر کسی تیسرے فریق کے ذریعے ہائی جیک نہ ہو۔

source: If you have configured your browser to disable cookies, please re-enable them, at least for this site, or for “same-origin” requests.
ur: اگر آپ نے اپنے براؤزر کو کوکیز کو غیر فعال کرنے کے لیے ترتیب دیا ہے، تو براہ کرم انہیں دوبارہ فعال کریں، کم از کم اس سائٹ کے لیے، یا “سیم اوریجن” درخواستوں کے لیے۔

source: More information is available with DEBUG=True.
ur: مزید معلومات DEBUG=True کے ساتھ دستیاب ہیں۔

source: No year specified
ur: سال مخصوص نہیں کیا گیا

source: Date out of range
ur: تاریخ حد سے باہر ہے

source: No month specified
ur: مہینہ مخصوص نہیں کیا گیا

source: No day specified
ur: دن مخصوص نہیں کیا گیا

source: No week specified
ur: ہفتہ مخصوص نہیں کیا گیا

source: No %(verbose_name_plural)s available
ur: کوئی %(verbose_name_plural)s دستیاب نہیں

source: Future %(verbose_name_plural)s not available because %(class_name)s.allow_future is False.
ur: مستقبل کے %(verbose_name_plural)s دستیاب نہیں کیونکہ %(class_name)s.allow_future غلط ہے۔

source: Invalid date string “%(datestr)s” given format “%(format)s”
ur: غلط تاریخ سٹرنگ “%(datestr)s” دی گئی فارمیٹ “%(format)s”

source: No %(verbose_name)s found matching the query
ur: کوئی %(verbose_name)s سوال سے مطابقت نہیں رکھتا

source: Page is not “last”, nor can it be converted to an int.
ur: صفحہ “آخری” نہیں ہے، اور نہ ہی اسے عدد میں تبدیل کیا جا سکتا ہے۔

source: Invalid page (%(page_number)s): %(message)s
ur: غلط صفحہ (%(page_number)s): %(message)s

source: Empty list and “%(class_name)s.allow_empty” is False.
ur: فہرست خالی ہے اور “%(class_name)s.allow_empty” غلط ہے۔

source: Directory indexes are not allowed here.
ur: ڈائریکٹری انڈیکس یہاں کی اجازت نہیں ہے۔

source: “%(path)s” does not exist
ur: “%(path)s” موجود نہیں ہے

source: Index of %(directory)s
ur: %(directory)s کا انڈیکس

source: The install worked successfully! Congratulations!
ur: انسٹال کامیابی سے مکمل ہو گیا! مبارک ہو!

source: View <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">release notes</a> for Django %(version)s
ur: Django %(version)s کے لیے <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">ریلیز نوٹس</a> دیکھیں

source: You are seeing this page because <a href="https://docs.djangoproject.com/en/%(version)s/ref/settings/#debug" target="_blank" rel="noopener">DEBUG=True</a> is in your settings file and you have not configured any URLs.
ur: آپ یہ صفحہ دیکھ رہے ہیں کیونکہ آپ کی سیٹنگز فائل میں <a href="https://docs.djangoproject.com/en/%(version)s/ref/settings/#debug" target="_blank" rel="noopener">DEBUG=True</a> ہے اور آپ نے کوئی URLs ترتیب نہیں دیے۔

source: Django Documentation
ur: Django دستاویزات

source: Topics, references, &amp; how-to’s
ur: موضوعات، حوالہ جات، اور طریقہ کار

source: Tutorial: A Polling App
ur: سبق: ایک پولنگ ایپ

source: Get started with Django
ur: Django کے ساتھ آغاز کریں

source: Django Community
ur: Django کمیونٹی

source: Connect, get help, or contribute
ur: رابطہ کریں، مدد حاصل کریں، یا تعاون کریں
